In [1]:
import pandas as pd

In [2]:
dict1={'Name':['ABC','BCD','CDE','DEF','EFG','FGI','GHI'],
      'Marks':[99,98,95,96,99,89,95],
      'Gender':['Male','FeMale','FeMale','Male','FeMale','Male','FeMale']}
      
df1=pd.DataFrame(dict1)
df1

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
2  CDE     95  FeMale
3  DEF     96    Male
4  EFG     99  FeMale
5  FGI     89    Male
6  GHI     95  FeMale

In [3]:
df1.head(3)

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
2  CDE     95  FeMale

In [4]:
df1.tail(3)

  Name  Marks  Gender
4  EFG     99  FeMale
5  FGI     89    Male
6  GHI     95  FeMale

In [5]:
df1.shape

(7, 3)

In [6]:
print('Number of rows',df1.shape[0])
print('Number of coloumns',df1.shape[1])

Number of rows 7
Number of coloumns 3

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [8]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [9]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
df1.Marks.sum()

671

In [11]:
df1.Gender.sum()

'MaleFeMaleFeMaleMaleFeMaleMaleFeMale'

In [12]:
df1.Name.sum()

'ABCBCDCDEDEFEFGFGIGHI'

In [13]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [14]:
df1.describe()

           Marks
count   7.000000
mean   95.857143
std     3.484660
min    89.000000
25%    95.000000
50%    96.000000
75%    98.500000
max    99.000000

In [15]:
df1.describe(include='all')

       Name      Marks  Gender
count     7   7.000000       7
unique    7        NaN       2
top     CDE        NaN  FeMale
freq      1        NaN       4
mean    NaN  95.857143     NaN
std     NaN   3.484660     NaN
min     NaN  89.000000     NaN
25%     NaN  95.000000     NaN
50%     NaN  96.000000     NaN
75%     NaN  98.500000     NaN
max     NaN  99.000000     NaN

In [16]:
df1['Gender'].unique()

array(['Male', 'FeMale'], dtype=object)

In [17]:
df1['Marks'].unique()

array([99, 98, 95, 96, 89], dtype=int64)

In [18]:
df1['Name'].unique()

array(['ABC', 'BCD', 'CDE', 'DEF', 'EFG', 'FGI', 'GHI'], dtype=object)

In [19]:
df1['Gender'].nunique()

2

In [20]:
df1['Marks'].nunique()

5

In [21]:
df1['Gender'].value_counts()

FeMale    4
Male      3
Name: Gender, dtype: int64

In [22]:
df1['Marks']>=90

0     True
1     True
2     True
3     True
4     True
5    False
6     True
Name: Marks, dtype: bool

In [23]:
df1[df1['Marks']>95]

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
3  DEF     96    Male
4  EFG     99  FeMale

In [24]:
df1[(df1['Marks']>95) & (df1['Marks']<100)]

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
3  DEF     96    Male
4  EFG     99  FeMale

In [25]:
df1[(df1['Marks']>95) | (df1['Marks']<100)]

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
2  CDE     95  FeMale
3  DEF     96    Male
4  EFG     99  FeMale
5  FGI     89    Male
6  GHI     95  FeMale

In [36]:
len(df1[(df1['Marks']>=95) & (df1['Marks']<100)])

6

In [34]:
df1['Marks'].between(95,100)

0     True
1     True
2     True
3     True
4     True
5    False
6     True
Name: Marks, dtype: bool

In [35]:
sum(df1['Marks'].between(95,100))

6

In [37]:
df1['Marks'].mean()

95.85714285714286

In [38]:
df1['Marks'].min()

89

In [39]:
df1['Marks'].max()

99

In [45]:
def marks(x):
    return x//2

In [46]:
df1['Marks'].apply(marks)

0    49
1    49
2    47
3    48
4    49
5    44
6    47
Name: Marks, dtype: int64

In [47]:
0=df1['Marks'].apply(marks)

In [48]:
df1

  Name  Marks  Gender  Half_Marks
0  ABC     99    Male          49
1  BCD     98  FeMale          49
2  CDE     95  FeMale          47
3  DEF     96    Male          48
4  EFG     99  FeMale          49
5  FGI     89    Male          44
6  GHI     95  FeMale          47

In [49]:
df1['Marks'].apply(lambda x:x/2)

0    49.5
1    49.0
2    47.5
3    48.0
4    49.5
5    44.5
6    47.5
Name: Marks, dtype: float64

In [50]:
df1['Name'].apply(len)

0    3
1    3
2    3
3    3
4    3
5    3
6    3
Name: Name, dtype: int64

In [51]:
df1

  Name  Marks  Gender  Half_Marks
0  ABC     99    Male          49
1  BCD     98  FeMale          49
2  CDE     95  FeMale          47
3  DEF     96    Male          48
4  EFG     99  FeMale          49
5  FGI     89    Male          44
6  GHI     95  FeMale          47

In [55]:
df1['Gender'].map({'Male':1,'FeMale':0})

KeyError: 'Gender'

In [56]:
dict1={'Name':['ABC','BCD','CDE','DEF','EFG','FGI','GHI'],
      'Marks':[99,98,95,96,99,89,95],
      'Gender':['Male','FeMale','FeMale','Male','FeMale','Male','FeMale']}
      
df1=pd.DataFrame(dict1)
df1

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
2  CDE     95  FeMale
3  DEF     96    Male
4  EFG     99  FeMale
5  FGI     89    Male
6  GHI     95  FeMale

In [57]:
df1['Gender'].map({'Male':1,'FeMale':0})

0    1
1    0
2    0
3    1
4    0
5    1
6    0
Name: Gender, dtype: int64

In [58]:
df1

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
2  CDE     95  FeMale
3  DEF     96    Male
4  EFG     99  FeMale
5  FGI     89    Male
6  GHI     95  FeMale

In [59]:
df1['Half_Marks']=df1['Marks'].apply(lambda x:x/2)

In [60]:
df1

  Name  Marks  Gender  Half_Marks
0  ABC     99    Male        49.5
1  BCD     98  FeMale        49.0
2  CDE     95  FeMale        47.5
3  DEF     96    Male        48.0
4  EFG     99  FeMale        49.5
5  FGI     89    Male        44.5
6  GHI     95  FeMale        47.5

In [61]:
df1['Male_FeMale']=df1['Gender'].map({'Male':1,'FeMale':0})

In [62]:
df1

  Name  Marks  Gender  Half_Marks  Male_FeMale
0  ABC     99    Male        49.5            1
1  BCD     98  FeMale        49.0            0
2  CDE     95  FeMale        47.5            0
3  DEF     96    Male        48.0            1
4  EFG     99  FeMale        49.5            0
5  FGI     89    Male        44.5            1
6  GHI     95  FeMale        47.5            0

In [64]:
df1.drop('Male_FeMale',axis=1)

  Name  Marks  Gender  Half_Marks
0  ABC     99    Male        49.5
1  BCD     98  FeMale        49.0
2  CDE     95  FeMale        47.5
3  DEF     96    Male        48.0
4  EFG     99  FeMale        49.5
5  FGI     89    Male        44.5
6  GHI     95  FeMale        47.5

In [76]:
df1.drop(['Half_Marks','Male_FeMale'],axis=1,inplace=True)

In [77]:
df1

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
2  CDE     95  FeMale
3  DEF     96    Male
4  EFG     99  FeMale
5  FGI     89    Male
6  GHI     95  FeMale

In [81]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [82]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [83]:
df1.sort_values(by='Marks')

  Name  Marks  Gender
5  FGI     89    Male
2  CDE     95  FeMale
6  GHI     95  FeMale
3  DEF     96    Male
1  BCD     98  FeMale
0  ABC     99    Male
4  EFG     99  FeMale

In [85]:
df1.sort_values(by=['Marks','Gender'])

  Name  Marks  Gender
5  FGI     89    Male
2  CDE     95  FeMale
6  GHI     95  FeMale
3  DEF     96    Male
1  BCD     98  FeMale
4  EFG     99  FeMale
0  ABC     99    Male

In [90]:
df1['Gender']=='FeMale'

0    False
1     True
2     True
3    False
4     True
5    False
6     True
Name: Gender, dtype: bool

In [93]:
df1[df1['Gender']=='FeMale'][['Name','Marks']

  Name  Marks
1  BCD     98
2  CDE     95
4  EFG     99
6  GHI     95